""""
Задача 2: Найдите сумму цифр трехзначного числа.
*Пример:*
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) |
"""

print ('Введите трехзначное число: ')
k = input()
k = int(k)

a = k%10
m = k//10
b = m%10
c = m//10

print(a+b+c)
